{
    "id": "bleak_falls_barrow",
    "title": "Bleak Falls Barrow",
    "game": "skyrimse",
    "category": "Main Quest",
    "tags": [
        "golden claw",
        "dragonstone",
        "puzzle",
        "first dungeon"
    ],
    "steps": [
        {
            "id": "puzzle_pillars",
            "title": "The Pillar Puzzle",
            "description": "In the first main chamber, you encounter a lever and three rotating pillars with animal symbols.",
            "vanilla_solution": "Snake, Snake, Whale (Left to Right, facing the gate). Look above the gate for the fallen stones.",
            "mod_notes": [
                {
                    "mod_id": "bleak_falls_overhaul",
                    "note": "The lever is moved to the hidden room on the left, guarded by a skeever."
                },
                {
                    "mod_id": "skyrim_immersive_creatures",
                    "note": "Watch out for the Goblin ambush immediately after pulling the lever."
                }
            ],
            "bugs": [
                {
                    "symptom": "Lever won't move",
                    "fix": "You likely didn't set the pillars correctly, or a script is lagging. Wait 10 seconds and try again."
                }
            ]
        },
        {
            "id": "spider_room",
            "title": "The Wounded Frostbite Spider",
            "description": "A giant spider descends from the ceiling.",
            "vanilla_strategy": "Retreat to the archway where it cannot fit. Use flames or arrows.",
            "mod_notes": [
                {
                    "mod_id": "ordinator",
                    "note": "If you have the 'Wild Companion' perk, you can actually calm this spider."
                },
                {
                    "mod_id": "know_your_enemy",
                    "note": "This spider has high resistance to physical damage. Use Fire magic."
                }
            ]
        },
        {
            "id": "golden_claw_door",
            "title": "The Puzzle Door",
            "description": "A large circular door with three rotating rings and a keyhole.",
            "vanilla_solution": "Bear, Moth, Owl (Top to Bottom). Inspect the Golden Claw in your inventory and rotate it to see the code.",
            "bugs": [
                {
                    "symptom": "Rings won't turn",
                    "fix": "Common bug. Save your game, punch the ring, then reload the save. If that fails, open console (`~`), click the door, and type `unlock` or `tcl` to fly through."
                },
                {
                    "symptom": "Claw doesn't work",
                    "fix": "Ensure you actually have the Golden Claw. If you returned it to Lucan before coming here, you must steal it back."
                }
            ]
        },
        {
            "id": "word_wall",
            "title": "The Word Wall & Overlord",
            "description": "The final chamber with the curved word wall.",
            "vanilla_strategy": "Learn the word 'Force'. The Draugr Overlord will burst from the coffin. He carries the Dragonstone.",
            "mod_notes": [
                {
                    "mod_id": "elfx",
                    "note": "The lighting here is extremely dark. Torches are mandatory."
                },
                {
                    "mod_id": "revenge_of_the_enemies",
                    "note": "The Overlord can shout 'Unrelenting Force'. Keep your back away from the ledge or you will be thrown off."
                }
            ]
        }
    ]
}
